Revit 2027 API
ExporterIFC.GetLayerNameForPresentationLayer Method
 Get the layer name associated with an element from the default layer mapping table.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLayerNameForPresentationLayer(
	Element pElement,
	ElementId categoryId
)
Public Function GetLayerNameForPresentationLayer (
	pElement As Element,
	categoryId As ElementId
) As String
public:
String^ GetLayerNameForPresentationLayer(
	Element^ pElement,
	ElementId^ categoryId
)
member GetLayerNameForPresentationLayer :
        pElement : Element *
        categoryId : ElementId -> string
Parameters
pElement Element
 The element.
categoryId ElementId
 The category id of the element.
Return Value
String
 The layer name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace